# SlantedColumnFailures Properties

---
The BuiltInFailuresSlantedColumnFailures type exposes the following members.
| Name| Description
---|---|---
| CannotCutParallelToLocationCurve|  Cut plane of slanted column end is parallel to the location curve.
| SlantedColumnCannotCutEnd|  Unable to trim slanted column end geometry to desired condition.
| SlantedColumnCannotCutEndWarn|  Unable to trim slanted column end geometry to desired condition.
Top
#### Reference
BuiltInFailuresSlantedColumnFailures Class
Autodesk.Revit.DB Namespace